blog/突破下限！看不懂的Ruby Fiber.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" href="https://jgkamat.gitlab.io/src/jgkamat.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org65b4298">1. Fiber基本使用</a></li>
<li><a href="#org13a333f">2. Fiber作用</a>
<ul>
<li><a href="#org7f2676a">2.1. 对于线程（thread）</a></li>
<li><a href="#org5905e9a">2.2. 对于事件驱动（EventMachine）</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org65b4298" class="outline-2">
<h2 id="org65b4298"><span class="section-number-2">1</span> Fiber基本使用</h2>
<div class="outline-text-2" id="text-1">
<p>
fiber使用一个block创造一个实例，block中的代码可以自行控制执行过程，类似javascript的Generator，下面是个例子。
</p>
</div>
</div>

<div id="outline-container-org13a333f" class="outline-2">
<h2 id="org13a333f"><span class="section-number-2">2</span> Fiber作用</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
Fibers are primitives for implementing light weight cooperative concurrency in Ruby. Basically they are a means of creating code blocks that can be paused and resumed, much like threads
</p>
</blockquote>
</div>

<div id="outline-container-org7f2676a" class="outline-3">
<h3 id="org7f2676a"><span class="section-number-3">2.1</span> 对于线程（thread）</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Fiber是thread的辅助，可以说是一种调度模式，fiber目的是可以更灵活的分配concurrency(并发)资源，虽然无法实现真正的parallelism(并行)。
这里额外说一下，对于使用GIL的ruby来说，只允许一个时间中有一个唯一的进程，所以ruby没有并行处理任务的优势。记得Matz也说过进程问题是ruby的最大错误，然而已经不能回头了。
</p>

<blockquote>
<p>
并发：逻辑上的同时发生，并不一定要同时发生
并行：物理上的同时发生，同时发生两个并发事件
并行必是并发，而并发不一定并行
</p>
</blockquote>

<blockquote>
<p>
Ruby never allows more than one of its native threads to run at the same time. Now the GIL is the bottleneck, and Ruby will never take advantage of multiple cores!
</p>
</blockquote>

<p>
如果开启多个线程(thread)，ruby会平均分配时间，意味着每个线程都会占用相同的时间运行自己的任务，这显然造成了资源的浪费。fiber功能的提供给我我们手动调节这种时间分配的入口，虽然会让程序更为复杂，但是灵活度增加了很多。
</p>
</div>
</div>

<div id="outline-container-org5905e9a" class="outline-3">
<h3 id="org5905e9a"><span class="section-number-3">2.2</span> 对于事件驱动（EventMachine）</h3>
<div class="outline-text-3" id="text-2-2">
<p>
和多线程对应的另一套方案是EventMachine(以下简称EM)。EM允许我们用异步的方式执行程序，从而处理一些io事物（如http request）,问题就是会有许多前套的callback，即callback hell（这里跟javascript简直太像）。
</p>

<div class="org-src-container">
<pre class="src src-ruby">http = <span style="color: #7CB8BB;">EventMachine</span>::<span style="color: #7CB8BB;">HttpRequest</span>.new(<span style="color: #CC9393;">'http://niltouch.cn/'</span>)

http.callback <span style="color: #F0DFAF; font-weight: bold;">do</span> |response|
  <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">...</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>

http.errback <span style="color: #F0DFAF; font-weight: bold;">do</span> |error|
  <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">...</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>

http.start
</pre>
</div>

<p>
如果callback中还有其他io操作，callback代码占满屏，除了酷炫之外只会降低代码的可理解性，借助fiber的yield挂起和resume功能，可以把异步代码写的跟同步代码一样和谐。
</p>
<blockquote>
<p>
这里可以顺便看一下es6的Generator，应该是类似的。
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #DCDCCC; font-weight: bold;">require</span> <span style="color: #CC9393;">'fiber'</span>

<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">async_fetch</span>(url)
  f = <span style="color: #7CB8BB;">Fiber</span>.current
  http = <span style="color: #7CB8BB;">EventMachine</span>::<span style="color: #7CB8BB;">HttpRequest</span>.new(url).get <span style="color: #BFEBBF;">timeout:</span> <span style="color: #BFEBBF;">10</span>
  http.callback { f.resume(http) }
  http.errback { f.resume(http) }

  <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #7CB8BB;">Fiber</span>.yield
<span style="color: #F0DFAF; font-weight: bold;">end</span>

<span style="color: #7CB8BB;">EventMachine</span>.run <span style="color: #F0DFAF; font-weight: bold;">do</span>
  <span style="color: #7CB8BB;">Fiber</span>.new <span style="color: #F0DFAF; font-weight: bold;">do</span>
    data = async_fetch(<span style="color: #CC9393;">'http://niltouch.cn'</span>)

    <span style="color: #7CB8BB;">EventMachine</span>.stop
  <span style="color: #F0DFAF; font-weight: bold;">end</span>.resume
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.3.1)</p>
</div>
</div>
</body>
</html>
